#! /bin/bash
#####################################################################
#   Goal: Build My Chinese Man
#####################################################################

##################################
# Import File
##################################
filepath=$(cd "$(dirname "$0")"; pwd)

##################################
# Variable
##################################
man_resource_path=$filepath"/resources/man"

##################################
# Function
##################################
function Usage() {
    echo "你想打开哪个手册页面？"
    # exit status, 2 means Incorrect Usage
    exit 2
}

##################################
# Execute
##################################
if [ $# -eq 0 ]; then
    Usage
fi

man -M $man_resource_path $@
